Repository: ade-karya/alp-flutter
Catalog: lib/l10n/arb/app_*.arb
Languages: ar, id

# welcomeMessage
source: Welcome to Adaptive Learning Platform
ar: مرحبًا بكم في منصة التعليم المتكيف
id: Selamat datang di Platform Pembelajaran Adaptif

# settingsLanguage
source: Language
ar: اللغة
id: Bahasa

# settingsLanguageEnglish
source: English
ar: الإنجليزية
id: Inggris

# settingsLanguageIndonesian
source: Indonesian
ar: الإندونيسية
id: Indonesia

# onboardingTitle1
source: Welcome to Adaptive Learning
ar: مرحبًا بكم في التعلم المتكيف
id: Selamat Datang di Pembelajaran Adaptif

# onboardingDesc1
source: Personalized learning experience powered by AI.
ar: تجربة تعلم مخصصة مدعومة بالذكاء الاصطناعي.
id: Pengalaman belajar yang dipersonalisasi didukung oleh AI.

# onboardingTitle2
source: Track Your Progress
ar: تتبع تقدمك
id: Pantau Kemajuan Anda

# onboardingDesc2
source: Monitor your achievements and growth over time.
ar: راقب إنجازاتك ونموك بمرور الوقت.
id: Pantau pencapaian dan pertumbuhan Anda dari waktu ke waktu.

# onboardingTitle3
source: Connect with Teachers
ar: تواصل مع المعلمين
id: Terhubung dengan Guru

# onboardingDesc3
source: Get guidance and support from your educators.
ar: احصل على التوجيه والدعم من معلميك.
id: Dapatkan bimbingan dan dukungan dari pendidik Anda.

# onboardingGetStarted
source: Get Started
ar: ابدأ الآن
id: Mulai Sekarang

# onboardingJoinCommunity
source: Join our community of learners and educators.
ar: انضم إلى مجتمع المتعلمين والمعلمين لدينا.
id: Bergabunglah dengan komunitas pembelajar dan pendidik kami.

# loginTitle
source: Login
ar: تسجيل الدخول
id: Masuk

# loginButton
source: Login
ar: دخول
id: Masuk

# registerButton
source: Register
ar: تسجيل
id: Daftar

# registerLink
source: New here? Create an account
ar: جديد هنا؟ إنشاء حساب
id: Belum punya akun? Buat akun baru

# roleStudent
source: Student
ar: طالب
id: Siswa

# roleTeacher
source: Teacher
ar: معلم
id: Guru

# labelNISN
source: NISN
ar: NISN (رقم الطالب)

# labelNUPTK
source: NUPTK
ar: NUPTK (رقم المعلم)

# labelPIN
source: PIN
ar: الرمز السري

# labelIdentifier
source: Identifier
ar: المعرف
id: Pengenal

# errorEmptyNISN
source: Please enter your NISN
ar: يرجى إدخال رقم الطالب
id: Mohon masukkan NISN Anda

# errorEmptyNUPTK
source: Please enter your NUPTK
ar: يرجى إدخال رقم المعلم
id: Mohon masukkan NUPTK Anda

# errorEmptyPIN
source: Please enter your PIN
ar: يرجى إدخال الرمز السري
id: Mohon masukkan PIN Anda

# errorShortPIN
source: PIN must be at least 4 digits
ar: الرمز السري يجب أن يكون 4 أرقام على الأقل
id: PIN harus minimal 4 digit

# registerTitle
source: Register
ar: تسجيل
id: Daftar

# labelName
source: Full Name
ar: الاسم الكامل
id: Nama Lengkap

# labelDateOfBirth
source: Date of Birth
ar: تاريخ الميلاد
id: Tanggal Lahir

# errorEmptyName
source: Please enter your name
ar: يرجى إدخال اسمك
id: Mohon masukkan nama Anda

# errorEmptyDate
source: Please enter your date of birth
ar: يرجى إدخال تاريخ ميلادك
id: Mohon masukkan tanggal lahir Anda

# loginLink
source: Already have an account? Login
ar: لديك حساب بالفعل؟ تسجيل الدخول
id: Sudah punya akun? Masuk

# registerSelectRole
source: Select Your Role
ar: اختر دورك
id: Pilih Peran Anda

# registerStudentTitle
source: Student Registration
ar: تسجيل الطلاب
id: Pendaftaran Siswa

# registerTeacherTitle
source: Teacher Registration
ar: تسجيل المعلمين
id: Pendaftaran Guru

# labelConfirmPIN
source: Confirm PIN
ar: تأكيد الرمز السري
id: Konfirmasi PIN

# helperPIN
source: Create a 4-digit PIN for security
ar: أنشئ رمزًا سريًا من 4 أرقام للأمان
id: Buat 4 digit PIN untuk keamanan

# errorConfirmPIN
source: Please confirm your PIN
ar: يرجى تأكيد الرمز السري
id: Mohon konfirmasi PIN Anda

# errorMatchPIN
source: PINs do not match
ar: الرموز السرية غير متطابقة
id: PIN tidak cocok

# labelSelectDate
source: Select date
ar: اختر التاريخ
id: Pilih tanggal

# errorNISNLength
source: NISN must be 10 digits
ar: رقم الطالب يجب أن يكون 10 أرقام
id: NISN harus 10 digit

# errorNUPTKLength
source: NUPTK must be 16 digits
ar: رقم المعلم يجب أن يكون 16 رقمًا
id: NUPTK harus 16 digit

# errorPINLength
source: PIN must be exactly 4 digits
ar: الرمز السري يجب أن يكون 4 أرقام بالضبط
id: PIN harus tepat 4 digit

# buttonNext
source: Next
ar: التالي
id: Lanjut

# buttonBack
source: Back
ar: السابق
id: Kembali

# registrationSuccessTitle
source: Registration Successful
ar: تم التسجيل بنجاح
id: Pendaftaran Berhasil

# registrationSuccessContent
source: User {identifier} registered successfully. Please login.
ar: تم تسجيل المستخدم {identifier} بنجاح. يرجى تسجيل الدخول.
id: Pengguna {identifier} berhasil terdaftar. Silakan masuk.

# buttonOK
source: OK
ar: حسناً

# dashboardStudent
source: Student Portal
ar: بوابة الطالب
id: Portal Siswa

# dashboardTeacher
source: Teacher Portal
ar: بوابة المعلم
id: Portal Guru

# navDashboard
source: Dashboard
ar: لوحة التحكم
id: Dasbor

# navSettings
source: Profile Settings
ar: إعدادات الملف الشخصي
id: Pengaturan Profil

# navEditProfile
source: Edit Profile
ar: تعديل الملف الشخصي
id: Edit Profil

# navSwitchUser
source: Switch User
ar: تبديل المستخدم
id: Ganti Pengguna

# navChangePin
source: Change PIN
ar: تغيير الرمز السري
id: Ubah PIN

# changePinTitle
source: Change PIN
ar: تغيير الرمز السري
id: Ubah PIN

# changePinCurrentLabel
source: Current PIN
ar: الرمز السري الحالي
id: PIN Saat Ini

# changePinNewLabel
source: New PIN
ar: الرمز السري الجديد
id: PIN Baru

# changePinConfirmLabel
source: Confirm New PIN
ar: تأكيد الرمز السري الجديد
id: Konfirmasi PIN Baru

# changePinSuccess
source: PIN changed successfully!
ar: تم تغيير الرمز السري بنجاح!
id: PIN berhasil diubah!

# changePinErrorCurrent
source: Current PIN is incorrect
ar: الرمز السري الحالي غير صحيح
id: PIN saat ini salah

# changePinErrorEmpty
source: Please fill all fields
ar: يرجى ملء جميع الحقول
id: Mohon isi semua kolom

# navLogout
source: Logout
ar: تسجيل الخروج
id: Keluar

# navLanguage
source: Language
ar: اللغة
id: Bahasa

# tileAITutor
source: AI Tutor
ar: المعلم الذكي
id: Tutor AI

# tileMyCourses
source: My Courses
ar: دوراتي
id: Kursus Saya

# tileProgress
source: Progress
ar: التقدم
id: Kemajuan

# tileAIAssistant
source: AI Assistant
ar: مساعد الذكاء الاصطناعي
id: Asisten AI

# tileCreateContent
source: Create Content
ar: إنشاء محتوى
id: Buat Konten

# tileAnalytics
source: Student Analytics
ar: تحليلات الطلاب
id: Analitik Siswa

# tileManageClass
source: Manage Class
ar: إدارة الفصل
id: Kelola Kelas

# aiAssistantTitle
source: AI Assistant Settings
ar: إعدادات مساعد الذكاء الاصطناعي
id: Pengaturan Asisten AI

source: Active Provider
ar: المزود النشط
id: Provider Aktif

source: All Providers
ar: جميع المزودين
id: Semua Provider

# noApiKey
source: No API Key configured
ar: مفتاح API غير مكوّن
id: API Key belum dikonfigurasi

source: Active
ar: نشط
id: Aktif

# labelBaseUrl
source: Base URL
ar: الرابط الأساسي
id: URL Dasar

# labelApiKey
source: API Key
ar: مفتاح API

source: Reset URL
ar: إعادة تعيين الرابط

# saveAndActivate
source: Save & Activate
ar: حفظ وتفعيل
id: Simpan & Aktifkan

# providerSaved
source: Provider settings saved and activated
ar: تم حفظ الإعدادات وتفعيل المزود
id: Pengaturan provider disimpan dan diaktifkan

# labelModel
source: Model
ar: نموذج

source: Fetch Models
ar: جلب النماذج
id: Ambil Model

# themePlayful
source: Switch to Serious
ar: تبديل إلى جاد
id: Ubah ke Serius

# themeSerious
source: Switch to Playful
ar: تبديل إلى مرح
id: Ubah ke Ceria

source: Feature coming soon!
ar: الميزة قادمة قريباً!
id: Fitur segera hadir!

# ccTitle
source: Create Content
ar: إنشاء محتوى
id: Buat Konten

# ccSnackBarError
source: Please enter both topic and grade level
ar: يرجى إدخال الموضوع والصف الدراسي
id: Mohon masukkan topik dan tingkat kelas

# ccErrorApiKey
source: API Key not found. Please check your Profile settings.
ar: مفتاح API غير موجود. يرجى التحقق من إعدادات الملف الشخصي.
id: API Key tidak ditemukan. Cek pengaturan Profil.

# ccTopicLabel
source: Topic
ar: الموضوع
id: Topik

# ccTopicHint
source: e.g., Photosynthesis
ar: مثال: البناء الضوئي
id: cth., Fotosintesis

# ccGradeLabel
source: Grade Level
ar: الصف الدراسي
id: Tingkat Kelas

# ccGradeHint
source: e.g., 5th Grade
ar: مثال: الصف الخامس
id: cth., Kelas 5 SD

# ccGenerateButton
source: Generate Lesson Plan
ar: إنشاء خطة الدرس
id: Buat Rencana Pembelajaran

# ccContentPlaceholder
source: Generated content will appear here...
ar: المحتوى المُنشأ سيظهر هنا...
id: Konten yang dibuat akan muncul di sini...

# ccErrorGenerating
source: Error generating content: {error}
ar: خطأ في إنشاء المحتوى: {error}
id: Gagal membuat konten: {error}

# mcTitle
source: Manage Classes
ar: إدارة الفصول
id: Kelola Kelas

# mcSnackBarCreated
source: Class "{name}" created! PIN: {pin}
ar: تم إنشاء الفصل "{name}"! الرمز السري: {pin}
id: Kelas "{name}" dibuat! PIN: {pin}

# mcErrorCreating
source: Error creating class: {error}
ar: خطأ في إنشاء الفصل: {error}
id: Gagal membuat kelas: {error}

# mcDialogTitle
source: Create New Class
ar: إنشاء فصل جديد
id: Buat Kelas Baru

# mcClassNameLabel
source: Class Name
ar: اسم الفصل
id: Nama Kelas

# mcClassDescLabel
source: Description (Optional)
ar: الوصف (اختياري)
id: Deskripsi (Opsional)

# mcEnrolledStudents
source: Enrolled Students:
ar: الطلاب المسجلين:
id: Siswa Terdaftar:

# mcNoStudents
source: No students yet.
ar: لا يوجد طلاب بعد.
id: Belum ada siswa.

# mcFabCreate
source: Create Class
ar: إنشاء فصل
id: Buat Kelas

# mcNoClasses
source: No classes created yet.
ar: لم يتم إنشاء فصول بعد.
id: Belum ada kelas yang dibuat.

# commonCancel
source: Cancel
ar: إلغاء
id: Batal

# commonCreate
source: Create
ar: إنشاء
id: Buat

# commonSave
source: Save
ar: حفظ
id: Simpan

# commonClose
source: Close
ar: إغلاق
id: Tutup

# usTitle
source: Select User
ar: اختر المستخدم
id: Pilih Pengguna

# usEnterPin
source: Enter PIN for {name}
ar: أدخل الرمز السري لـ {name}
id: Masukkan PIN untuk {name}

# usLabelPin
source: PIN
ar: الرمز السري

# usVerify
source: Verify
ar: تحقق
id: Verifikasi

# usIncorrectPin
source: Incorrect PIN
ar: الرمز السري غير صحيح
id: PIN Salah

# usSetPinTitle
source: Set Your PIN
ar: عيّن الرمز السري
id: Atur PIN Anda

# usSetPinMsg
source: Please set a 4-digit PIN for security
ar: يرجى تعيين رمز سري من 4 أرقام للأمان
id: Buat PIN 4 digit untuk keamanan

# usConfirmPin
source: Confirm PIN
ar: تأكيد الرمز السري
id: Konfirmasi PIN

# usPinMismatch
source: PINs do not match
ar: الرموز السرية غير متطابقة
id: PIN tidak cocok

# usPinLength
source: PIN must be 4 digits
ar: الرمز السري يجب أن يكون 4 أرقام
id: PIN harus 4 digit

# usSetPinButton
source: Set PIN
ar: حفظ الرمز السري
id: Simpan PIN

# usNoUsers
source: No users registered yet
ar: لم يتم تسجيل مستخدمين بعد
id: Belum ada pengguna terdaftar

# usAddUser
source: Add New User
ar: إضافة مستخدم جديد
id: Tambah Pengguna Baru

# profileTitle
source: Profile & Settings
ar: الملف الشخصي والإعدادات
id: Profil & Pengaturan

# profileGeminiConfig
source: Gemini API Configuration
ar: إعدادات Gemini API
id: Konfigurasi Gemini API

# profileApiKey
source: API Key
ar: مفتاح API

# profileApiKeySaved
source: API Key Saved
ar: تم حفظ مفتاح API
id: API Key Disimpan

# profileSelectModel
source: Select Model
ar: اختر النموذج
id: Pilih Model

# profileRefreshModels
source: Refresh Models
ar: تحديث النماذج
id: Segarkan Model

# profileNoModels
source: No models found. Check your API Key.
ar: لم يتم العثور على نماذج. تحقق من مفتاح API.
id: Model tidak ditemukan. Cek API Key Anda.

# profileSaveModel
source: Save Model
ar: حفظ النموذج
id: Simpan Model

# profileModelSaved
source: Model saved successfully!
ar: تم حفظ النموذج بنجاح!
id: Model berhasil disimpan!

# aiTutorTitle
source: AI Tutor
ar: المعلم الذكي
id: Tutor AI

# aiTutorSystemPrompt
source: You are a helpful and knowledgeable AI tutor for students. Explain concepts clearly and patiently in the language the student asks in.
ar: أنت معلم ذكاء اصطناعي مفيد واسع المعرفة للطلاب. اشرح المفاهيم بوضوح وصبر باللغة التي يسأل بها الطالب.
id: Anda adalah tutor AI yang membantu dan berpengetahuan luas untuk siswa. Jelaskan konsep dengan jelas dan sabar dalam bahasa yang diminta siswa.

# aiTutorErrorApiKey
source: API Key not found. Please check your Profile settings.
ar: مفتاح API غير موجود. يرجى التحقق من إعدادات الملف الشخصي.
id: API Key tidak ditemukan. Cek pengaturan Profil Anda.

# aiTutorHint
source: Ask your tutor...
ar: اسأل معلمك...
id: Tanya tutor Anda...

# aiTutorError
source: Error: {error}
ar: خطأ: {error}

# mcCoursesTitle
source: My Courses
ar: دوراتي
id: Kursus Saya

# mcJoinClass
source: Join Class
ar: الانضمام لفصل
id: Gabung Kelas

# mcClassNotFound
source: Class not found with that PIN
ar: لم يتم العثور على فصل بهذا الرمز
id: Kelas tidak ditemukan dengan PIN tersebut

# mcAlreadyEnrolled
source: You are already enrolled in this class
ar: أنت مسجل بالفعل في هذا الفصل
id: Anda sudah terdaftar di kelas ini

# mcJoinedSuccess
source: Joined class "{name}"!
ar: تم الانضمام للفصل "{name}"!
id: Berhasil bergabung ke kelas "{name}"!

# mcErrorJoining
source: Error joining class: {error}
ar: خطأ في الانضمام للفصل: {error}
id: Gagal bergabung kelas: {error}

# mcJoinDialogTitle
source: Join Class
ar: الانضمام لفصل
id: Gabung Kelas

# mcEnterPinLabel
source: Enter Class PIN
ar: أدخل رمز الفصل
id: Masukkan PIN Kelas

# mcCommonJoin
source: Join
ar: انضمام
id: Gabung

# mcNoCourses
source: You have not joined any classes yet.
ar: لم تنضم لأي فصول بعد.
id: Anda belum bergabung dengan kelas apapun.

# mcTeacherPrefix
source: Teacher: {name}
ar: المعلم: {name}
id: Guru: {name}

# languageSelectorTooltip
source: Select Language
ar: اختر اللغة
id: Pilih Bahasa

# ccContentTypeLabel
source: Content Type
ar: نوع المحتوى
id: Jenis Konten

# ccTypeLessonPlan
source: Lesson Plan
ar: خطة الدرس
id: Rencana Pelajaran

# ccTypeMultipleChoice
source: Multiple Choice
ar: اختيار من متعدد
id: Pilihan Ganda

# ccTypeEssay
source: Essay
ar: مقالي

# ccQuestionCountLabel
source: Number of Questions
ar: عدد الأسئلة
id: Jumlah Soal

# ccQuestionCountHint
source: e.g., 5
ar: مثال: 5
id: mis., 5

# ccGenerateMC
source: Generate Questions
ar: إنشاء الأسئلة
id: Buat Soal

# ccGenerateEssay
source: Generate Essay Questions
ar: إنشاء أسئلة مقالية
id: Buat Soal Essay

# ccSaveToBank
source: Save to Question Bank
ar: حفظ في بنك الأسئلة
id: Simpan ke Bank Soal

# ccEditQuestion
source: Edit Question
ar: تعديل السؤال
id: Edit Soal

# ccQuestionLabel
source: Questions
ar: أسئلة
id: Soal

# ccOptionA
source: Option A
ar: الخيار أ
id: Pilihan A

# ccOptionB
source: Option B
ar: الخيار ب
id: Pilihan B

# ccOptionC
source: Option C
ar: الخيار ج
id: Pilihan C

# ccOptionD
source: Option D
ar: الخيار د
id: Pilihan D

# ccCorrectAnswer
source: Correct Answer
ar: الإجابة الصحيحة
id: Jawaban Benar

# ccRubric
source: Scoring Rubric
ar: نموذج التقييم
id: Rubrik Penilaian

# ccFeedback
source: Feedback
ar: التغذية الراجعة
id: Umpan Balik

# ccSaved
source: Questions saved to bank!
ar: تم حفظ الأسئلة!
id: Soal berhasil disimpan!

# ccNoQuestions
source: No questions generated yet.
ar: لم يتم إنشاء أسئلة بعد.
id: Belum ada soal yang dibuat.

# ccParseError
source: Failed to parse AI response. Please try again.
ar: فشل في تحليل استجابة الذكاء الاصطناعي. حاول مرة أخرى.
id: Gagal memproses respons AI. Silakan coba lagi.

# qbTitle
source: Question Bank
ar: بنك الأسئلة
id: Bank Soal

# qbEmpty
source: No questions in the bank yet.
ar: لا توجد أسئلة في البنك بعد.
id: Belum ada soal di bank.

# qbDeleteConfirm
source: Delete this question?
ar: حذف هذا السؤال؟
id: Hapus soal ini?

# qbDeleted
source: Question deleted
ar: تم حذف السؤال
id: Soal dihapus

# qbRecentQuestions
source: Recent Questions
ar: أحدث الأسئلة
id: Soal Terbaru

# ccErrorTimeout
source: AI is taking too long to respond. Try reducing the number of questions.
ar: يستغرق الذكاء الاصطناعي وقتًا طويلاً للاستجابة. حاول تقليل عدد الأسئلة.
id: AI terlalu lama merespons. Coba kurangi jumlah soal.

# mcJoiningClass
source: Joining class...
ar: جاري الانضمام إلى الفصل...
id: Bergabung ke kelas...
